from chains.save_chain import state_gr_worker
from models.lesson import LessonExtraction    

lesson = LessonExtraction(
    start_text = """
        ותרת השיעור: לתת זה לקבל שיעור מפי הרב שמואל סעדון בשבת פרשת בהעלותך המסר העיקרי של הסיפור האדם הוא לא פרטי הוא צריך לתת מעצמו לכלל גם מי שנמצא בצד הרוחני לגמרי (למשל לומד כל היום תורה) וגם מי שנמצא כל היום בפרנסה צריכים שניהם להסתכל לכיוון האמצע (שהוא האלוהים) המנורה מקשה אחת היא ושני הצדדים צריכים להסתכל עליה.
    """
)
result = state_gr_worker.invoke(lesson)
print(result)


lesson2 = LessonExtraction(
    start_text = """
    כותרת השיעור: איך מנשימים אנשים, פרשת בהעלותך, אדם שאומר מילה טובה לחברו כאילן מנשים אותו, 2 אנשים לא דיברו לשןן הרע לעומת כל שאר המרגלים, חיים והמוות ביד הלשון, 
    מונה מספר לכוכבים ןלמרות זאת מעודד ענווים בישועה, 
    מגבהיי לשבת > ה יושב למעלה. 
    למרות כך בכל זאת משפילי לראות, הוא משפיל עצמו לראןת מה אנשים צריכים 
    עדיף לזכות את הרבים בדברים פשוטים מאשר שתעשה לעצמך ואפילו יותר איכותי
    מילה טובה שאתה אומר היום יכולה להיות הבסיס להצלחה שלו בעתיד
    אדם שרומם את חברו  וזיכה אותו, מביאים את דיוקנו לפני הקדוש ברוך הוא והוא מקבל ברכה ככמו אברהם אבינו, וה ברך את הרבהם בכל
    """
)
result2 = state_gr_worker.invoke(lesson2)
print(result2)